<?php

namespace App\Google;

class DocMap
{
    public const GENDERS = [
        ''     => 0,
        'М'    => 1,
        'м'    => 1,
        'Муж.' => 1,
        'Ж'    => 2,
        'ж'    => 2,
        'Жен.' => 2,
    ];

    public const STATUSES = [
        'Новый'                 => 'Новый',
        'Отказ'                 => 'Отказ',
        'В работе у клоузера'   => 'В работе у клоузера',
        'Нет ответа'            => 'Нет ответа',
        'нбт'                   => 'Нет ответа',
        'Демонстрация'          => 'Демонстрация',
        'Депозит'               => 'Депозит',
        'Перезвон'              => 'Перезвон',
        'Дубль'                 => 'Дубль',
        'Неверный номер'        => 'Неверный номер',
        'неверный номер'        => 'Неверный номер',
        'Резерв'                => 'Резерв',
    ];

    public const REASONS = [
        'нет 18'                       => 'нет 18',
        'неадекват'                    => 'неадекват',
        'отзывы'                       => 'отзывы',
        'сброс'                        => 'сброс',
        'нбт'                          => 'нбт',
        'нерезидент'                   => 'нерезидент',
        'в работе у другого менеджера' => 'в работе у другого менеджера',
        'случайная регистрация'        => 'случайная регистрация',
        'думал без денег можно'        => 'думал без денег можно',
        'Не говорит по русски'         => 'Не говорит по русски',
    ];

    public const PROFESSIONS = [
        'безработный' => 'безработный',
        'в декрете'   => 'в декрете',
        'пенсионер'   => 'пенсионер',
        'студент'     => 'студент',
        'работает'    => 'работает',
        'инвалид'     => 'инвалид',
    ];

    public const AGES = [
        '18-24' => '18-24',
        '25-34' => '25-34',
        '35-44' => '35-44',
        '45-54' => '45-54',
        '55-65' => '55-65',
        '66+'   => '66+',
    ];

    public const TIMEZONES = [
        'мск-1' => 'мск-1',
        'мск'   => 'мск',
        'мск+1' => 'мск+1',
        'мск+2' => 'мск+2',
        'мск+3' => 'мск+3',
        'мск+4' => 'мск+4',
        'мск+5' => 'мск+5',
        'мск+6' => 'мск+6',
        'мск+7' => 'мск+7',
        'мск+8' => 'мск+8',
        'мск+9' => 'мск+9'
    ];
}
